=begin
6. Сумма покупок.
Пользователь вводит поочередно название товара, цену за единицу и кол-во купленного товара (может
быть нецелым числом). Пользователь может ввести произвольное кол-во товаров до тех пор, пока не введет
"стоп" в качестве названия товара.
На основе введенных данных требуетеся:
Заполнить и вывести на экран хеш, ключами которого являются названия товаров, а значением - вложенный хеш,
содержащий цену за единицу товара и кол-во купленного товара. Также вывести итоговую сумму за каждый товар.
Вычислить и вывести на экран итоговую сумму всех покупок в "корзине".
=end

result = {}

product_amount = {}

all_amount = 0

loop do

  puts "Введите название товара."
  product = gets.chomp
  break if product == 'stop'

  puts "Введите цену товара."
  price = gets.to_f

  puts "Введите количество купленного товара."
  quantity = gets.to_f

  id_amount = price * quantity
  all_amount += id_amount

  product_amount[product] = id_amount

  parts = {}
  parts[price] = quantity
  #p parts
  result[product] = parts

end

p result

product_amount.each do |key, value|
  puts "Всего #{key} куплено на #{value} баксов!"
end

puts "Итоговая сумма всех покупок равна #{all_amount} наших баксов!!!"

