=begin
6. Сумма покупок.
Пользователь вводит поочередно название товара, цену за единицу и кол-во купленного товара (может
быть нецелым числом). Пользователь может ввести произвольное кол-во товаров до тех пор, пока не введет
"стоп" в качестве названия товара.
На основе введенных данных требуетеся:
Заполнить и вывести на экран хеш, ключами которого являются названия товаров, а значением - вложенный хеш,
содержащий цену за единицу товара и кол-во купленного товара. Также вывести итоговую сумму за каждый товар.
Вычислить и вывести на экран итоговую сумму всех покупок в "корзине".
=end

product = ""
result = {}
all_amount = 0

while product != "stop"

  puts "Введите название товара."
  product = gets.chomp
  break if product == "stop"

  puts "Введите цену товара."
  price = gets.to_f

  puts "Введите количество купленного товара."
  quantity = gets.to_f

  result[product] = {price: price, guantity: quantity, sum: price*quantity }

  all_amount += price * quantity
end

p result

result.each do |product, product_hash|
  puts "Всего #{product} куплено на #{product_hash[:sum]} баксов!"
end

puts "Итоговая сумма всех покупок равна #{all_amount} наших баксов!!!"

