=begin
Площадь треугольника. Площадь треугольника можно вычислить, зная его основание (a) и высоту (h)
по формуле: 1/2*a*h. Программа должна запрашивать основание и высоту треугольника и возвращать его площадь.
=end

puts "Находим площадь треугольника:"
puts
puts "Введите размер основания треугольника"
a = gets.chomp.to_f

puts "Введите размер высоты треугольника"
h = gets.chomp.to_f

s = 0.5 * a * h # Заменил 1/2 на 0,5, т.к. по-другому не получалось
print "Площадь треугольника равна #{s}"

puts